In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [4]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [6]:
# load default dataset "tips"

tips_df = sns.load_dataset("tips");
tips_df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [12]:
# divide dataset into "feature" and "label" sets or columns

X = tips_df.drop(['tip'], axis=1)
y = tips_df['tip']

In [19]:
# verify division of dataset for feature set

X.head()

   total_bill     sex smoker  day    time  size
0       16.99  Female     No  Sun  Dinner     2
1       10.34    Male     No  Sun  Dinner     3
2       21.01    Male     No  Sun  Dinner     3
3       23.68    Male     No  Sun  Dinner     2
4       24.59  Female     No  Sun  Dinner     4

In [20]:
# verify division of dataset for label set

y.head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [24]:
# drop categorical columns from the dataset

X_num = X.drop(["sex", "smoker", "day", "time"], axis=1)

In [25]:
X_num.head()

   total_bill  size
0       16.99     2
1       10.34     3
2       21.01     3
3       23.68     2
4       24.59     4

In [27]:
# isolate categorical columns from dataset

X_cat = X.filter(["sex", "smoker", "day", "time"])

In [29]:
X_cat.head()

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [34]:
# convert categorical columns into one-hot encoded columns

X_cat_num = pd.get_dummies(X_cat, drop_first=True)

In [35]:
X_cat_num.head()

   sex_Female  smoker_No  day_Fri  day_Sat  day_Sun  time_Dinner
0        True       True    False    False     True         True
1       False       True    False    False     True         True
2       False       True    False    False     True         True
3       False       True    False    False     True         True
4        True       True    False    False     True         True

In [37]:
# join one-hoted encoded with X_numabs

X_processed = pd.concat([X_num, X_cat_num], axis=1)

In [38]:
X_processed.head()

,total_bill,size,sex_Female,smoker_No,day_Fri,day_Sat,day_Sun,time_Dinner
0,16.99,2,True,True,False,False,True,True
1,10.34,3,False,True,False,False,True,True
2,21.01,3,False,True,False,False,True,True
3,23.68,2,False,True,False,False,True,True
4,24.59,4,True,True,False,False,True,True

In [41]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=0)

7      3.12
83     5.00
176    2.00
106    4.06
156    5.00
       ...
67     1.00
192    2.56
117    1.50
47     6.00
172    5.15
Name: tip, Length: 195, dtype: float64